// test.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <stdio.h>
#include <string.h>
#include <windows.h>

int main()
{
    //const char *str = "D99EE8030000D9E8D99EF0030000D9E8D99EEC030000D9E8D99E00040000C786DC03000004000000C786E403000004000000C786E003000004000000889632070000889633070000D9EE";
    //for (size_t i = 0; i < strlen(str); i++)
    //{
    //    if (i % 2 == 0)
    //    {
    //        printf("0x%c%c", str[i], str[i + 1]);
    //    }
    //    else
    //    {
    //        printf(", ");
    //    }
    //}
    //printf("\n");

    //printf("%d\n", sizeof(LONGLONG));//8/

    float a = 114514.0;
    a = a + 1;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
